packages/windninjapy/windninjapy-0.0.1-cp39-cp39-macosx_10_14_x86_64.macosx_14_0_arm64.whl/windninjapy/data/ninjafoam/9/system/controlDict_simpleFoam
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam; //simpleFoam, turbFoam, vmsFoam, etc;

startFrom       latestTime;

startTime       latestTime;

stopAt          endTime;

endTime         1000;

deltaT          1.0;

writeControl    timeStep;

writeInterval   $nIterations$;

purgeWrite      1;

writeFormat     ascii;

writePrecision  10;

writeCompression no;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;



libs
(
    "$lib$"
);


functions
{
    // to look at residuals as the simulation runs, or afterwards, run
    //  foamMonitor -l postProcessing/residuals/52/residuals.dat
    // see https://cfd.direct/openfoam/user-guide/v9-graphs-monitoring/#x33-2590006.3
    #includeFunc  residuals
}


// ************************************************************************* //
