packages/windninjapy/windninjapy-0.0.1-cp39-cp39-macosx_10_14_x86_64.macosx_14_0_arm64.whl/windninjapy/data/ninjafoam/9/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changePatchTypeDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dictionaryReplacement

{
    boundary
    {
     
    maxZ
        {
            type            patch;
       }
    maxX
        {
            type            patch;
       }
    maxY
        {
            type            symmetryPlane;
       }
    NAME
        {
            type            wall;
       }
    minX
        {
            type            patch;
       }
    minY
        {
            type            symmetryPlane;
       }
    minZ
        {
            type            wall;
       }  
    }
}

// ************************************************************************* //